REPLACE INTO `icpay`.`tbl_chnl_translate` (
    `chnl_id`, `class_name`, `catalog`, `src_code`, `dest_code`, `dest_msg`, `orderSeq`, `memo`, `last_oper_id`, `rec_crt_ts`, `rec_upd_ts`
) VALUES
('GJ', '*', 'PAY_NOTIFY', '*', '01', '失敗', 100, '代收通知：文檔「60=成功其他失敗」，預設失敗', '', '2026-04-24 17:42:01', '2026-04-25 15:21:41'),
('GJ', '*', 'PAY_NOTIFY', '60', '10', '成功', 100, '代收通知：支付成功', '', '2026-04-24 17:42:01', '2026-04-24 17:42:01'),
('GJ', '*', 'PAY_QRY', '*', '01', '處理中', 100, '代收查詢：文檔「60=成功其他未支付」，預設處理中', '', '2026-04-24 17:42:01', '2026-04-24 17:42:01'),
('GJ', '*', 'PAY_QRY', '20', '01', '新創建', 100, '代收查詢：訂單剛創建', '', '2026-04-24 17:42:01', '2026-04-24 17:42:01'),
('GJ', '*', 'PAY_QRY', '60', '10', '成功', 100, '代收查詢：支付成功', '', '2026-04-24 17:42:01', '2026-04-24 17:42:01'),
('GJ', '*', 'WITHDRAW', '*', '01', '处理中', 100, '代付同步響應：預設失敗', '', '2026-04-24 17:42:01', '2026-04-25 15:20:44'),
('GJ', '*', 'WITHDRAW', '200', '01', '提交成功處理中', 100, '代付同步響應：code=200 代表提交成功', '', '2026-04-24 17:42:01', '2026-04-24 17:42:01'),
('GJ', '*', 'WITHDRAW', '400', '20', '失敗', 100, '代付同步響應：code=400代表通道维护或超出限额', '', '2026-04-24 17:42:01', '2026-04-25 16:08:08'),
('GJ', '*', 'WITHDRAW', '406', '20', '失敗', 100, '代付同步響應：code=406 代表馀额不足', '', '2026-04-24 17:42:01', '2026-04-25 15:21:07'),
('GJ', '*', 'WITHDRAW_NOTIFY', '*', '01', '處理中', 100, '代付通知：文檔「50=取消其他成功」；保守設處理中，聯調確認成功碼', '', '2026-04-24 17:42:01', '2026-04-24 17:42:01'),
('GJ', '*', 'WITHDRAW_NOTIFY', '50', '20', '取消/失敗', 100, '代付通知：取消或失敗', '', '2026-04-24 17:42:01', '2026-04-24 17:42:01'),
('GJ', '*', 'WITHDRAW_NOTIFY', '60', '10', '成功', 100, '代付通知：推測成功碼（與代收一致，聯調確認）', '', '2026-04-24 17:42:01', '2026-04-24 17:42:01'),
('GJ', '*', 'WITHDRAW_QRY', '*', '01', '處理中', 100, '代付查詢：文檔「20=已受理 50=取消/失敗 其他=成功」；保守設處理中', '', '2026-04-24 17:42:01', '2026-04-24 17:42:01'),
('GJ', '*', 'WITHDRAW_QRY', '20', '01', '已受理', 100, '代付查詢：訂單已受理', '', '2026-04-24 17:42:01', '2026-04-24 17:42:01'),
('GJ', '*', 'WITHDRAW_QRY', '50', '20', '取消/失敗', 100, '代付查詢：取消或失敗', '', '2026-04-24 17:42:01', '2026-04-24 17:42:01'),
('GJ', '*', 'WITHDRAW_QRY', '60', '10', '成功', 100, '代付查詢：推測成功碼（與代收一致，聯調確認）', '', '2026-04-24 17:42:01', '2026-04-24 17:42:01');
